Revit 2027 API
ParameterUtils.DownloadCompanyName Method
Overload List
Name | Description
DownloadCompanyName(Document, ForgeTypeId) | Obsolete.
 Downloads the name of the given parameter's owning account and records it in the given document. If the owning account's name is already recorded in the given document, this method returns the name without downloading it again.
DownloadCompanyName(Document, ForgeTypeId, String) |  Downloads the name of the given parameter's owning account and records it in the given document. If the owning account's name is already recorded in the given document, this method returns the name without downloading it again.
Top
See Also
Reference
ParameterUtils Class
Autodesk.Revit.DB Namespace